tutorial_MSFR/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    hx
    {
      type               fixedValue;
      value              uniform (0 -2.5 0);
    }

    walls
    {
      type               fixedValue;
      value              uniform (0 0 0);
    }

    centerwall
    {
      type               slip;
    }

    empty
    {
        type            empty;
    }

}

// ************************************************************************* //
