tutorial_MSFR/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    hx
    {
      type            compressible::alphatWallFunction;
      Prt             0.85;
      value           $internalField;
    }

    walls
    {
      type            compressible::alphatWallFunction;
      Prt             0.85;
      value           $internalField;
    }

    centerwall
    {
      type            compressible::alphatWallFunction;
      Prt             0.85;
      value           $internalField;
    }

    empty
    {
        type            empty;
    }

}


// ************************************************************************* //
