tutorial_MSFR/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    hx
    {
      type            epsilonWallFunction;
      value           $internalField;
    }

    walls
    {
      type            epsilonWallFunction;
      value           $internalField;
    }

    centerwall
    {
      type            epsilonWallFunction;
      value           $internalField;
    }

    empty
    {
        type            empty;
    }

}


// ************************************************************************* //
