tutorial_MSFR/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 1e-4;

boundaryField
{

    hx
    {
      type            kqRWallFunction;
      value           $internalField;
    }

    walls
    {
      type            kqRWallFunction;
      value           $internalField;
    }

    centerwall
    {
      type            kqRWallFunction;
      value           $internalField;
    }

    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
